recept/src/DataProcessors/ТабличныйКонструкторРецептур/ТабличныйКонструкторРецептур.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ТабличныйКонструкторРецептур</name>
</mdclass:DataProcessor>

recept/src/Documents/Рецепт/Рецепт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Рецепт</name>
  <registerRecords>InformationRegister.Рецепт</registerRecords>
  <registerRecords>AccumulationRegister.СоставРецептур</registerRecords>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСтоимостьПроизводства</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаЗаКг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Переработка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Загрузка1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Загрузка2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Загрузка3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Загрузка4</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗагрузкаИтого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Компонент1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Компонент2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Компонент3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Компонент4</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомпонентСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.НоменклатураМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНаТонну</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияЗагрузки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

recept/src/DataProcessors/ТабличныйКонструкторРецептур/Forms/ФормаСравненияРецептур/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
    // 1. Получить ссылки на рецептуры
	Данные = ПолучитьДанныеСравнения(Параметры.СписокРецептур);

    // 2. Построить табличный документ
	ПостроитьТабДокумент(Данные);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьДанныеСравнения(СписокРецептур)

    // -----------------------------
    // 1. Получаем состав рецептур
    // -----------------------------
    
Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	РецептСостав.Ссылка КАК Рецептура,
	|	РецептСостав.Ссылка.Наименование КАК НаименованиеРецептуры,
	|	РецептСостав.НомерСтроки КАК НомерСтроки,
	|	РецептСостав.Материал,
	|	РецептСостав.Материал.Наименование,
	|	РецептСостав.КоличествоНаТонну КАК Количество
	|ИЗ
	|	Документ.Рецепт.Состав КАК РецептСостав
	|ГДЕ
	|	РецептСостав.Ссылка В (&СписокРецептур)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";

Запрос.УстановитьПараметр("СписокРецептур", СписокРецептур);

РезультатЗапроса = Запрос.Выполнить();

Выборка = РезультатЗапроса.Выбрать();

	ТаблицаКомпонентов = Новый Соответствие;   // Материал → Соответствие(Рецептура → Количество)
	Рецептуры = Новый Соответствие;            // Ссылка → Наименование
	ПорядокРецептур = Новый Массив;
	ПорядокКомпонентов = Новый Массив;
	ЦеныМатериалов = Новый Соответствие;
	ОстаткиМатериалов = Новый Соответствие;

	Пока Выборка.Следующий() Цикл
		
		// порядок рецептур
		Если Рецептуры.Получить(Выборка.Рецептура) = Неопределено Тогда
			Рецептуры.Вставить(Выборка.Рецептура, Выборка.НаименованиеРецептуры);
			ПорядокРецептур.Добавить(Выборка.Рецептура);
		КонецЕсли;
	
		// пустые строки состава пропускаем
		Если Выборка.Материал = Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		
		// порядок компонентов как в документе
		Если ПорядокКомпонентов.Найти(Выборка.Материал) = Неопределено Тогда
			ПорядокКомпонентов.Добавить(Выборка.Материал);
		КонецЕсли;
		
		// матрица количеств
		Если ТаблицаКомпонентов.Получить(Выборка.Материал) = Неопределено Тогда
			ТаблицаКомпонентов.Вставить(Выборка.Материал, Новый Соответствие);
		КонецЕсли;
		
		// цены материалов
		Если ЦеныМатериалов.Получить(Выборка.Материал) = Неопределено Тогда
			Цена = РаботаСоСправочниками.ЦенаМатериалов(ТекущаяДатаСеанса(), Выборка.Материал);
			ЦеныМатериалов.Вставить(Выборка.Материал, Цена);
		КонецЕсли;
		
		// остатки материалов
		Если ОстаткиМатериалов.Получить(Выборка.Материал) = Неопределено Тогда
			Остаток = РаботаСоСправочниками.ОстаткиМатериалов(Выборка.Материал);
			ОстаткиМатериалов.Вставить(Выборка.Материал, Остаток);
		КонецЕсли;
	
		ТаблицаКомпонентов[Выборка.Материал].Вставить(Выборка.Рецептура, Выборка.Количество);
		
	КонецЦикла;

	 // --------------------------------
    // 3. Возврат результата
    // --------------------------------

	Данные = Новый Структура;
	Данные.Вставить("Рецептуры", Рецептуры);
	Данные.Вставить("ПорядокРецептур", ПорядокРецептур);
	Данные.Вставить("ПорядокКомпонентов", ПорядокКомпонентов);
	Данные.Вставить("ТаблицаКомпонентов", ТаблицаКомпонентов);
	Данные.Вставить("ЦеныМатериалов", ЦеныМатериалов);
	Данные.Вставить("ОстаткиМатериалов", ОстаткиМатериалов);
	
	Возврат Данные;
	
КонецФункции

&НаСервере
Процедура ПостроитьТабДокумент(Данные)
	
	Если Данные = Неопределено Тогда
    	Возврат;
	КонецЕсли;

	//Данные = Параметры.ДанныеСравнения.Получить();
	
    Рецептуры = Данные.Рецептуры;
    Компоненты = Данные.ТаблицаКомпонентов;
    ПорядокРецептур = Данные.ПорядокРецептур;
    ПорядокКомпонентов = Данные.ПорядокКомпонентов;
    ЦеныМатериалов = Данные.ЦеныМатериалов;
    ОстаткиМатериалов = Данные.ОстаткиМатериалов;
	
	ТабДокумент.Очистить();
		
    // ===== ШАПКА =====
	Строка = 1;
	Колонка = 1;    
    
	Область = ТабДокумент.Область(Строка, Колонка);
	Область.Текст = "Компонент";
	Область.Шрифт = Новый Шрифт(,, Истина);
	Область.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	
	Колонка = Колонка + 1;
	
	Область = ТабДокумент.Область(Строка, Колонка);
	Область.Текст = "Цена";
	Область.Шрифт = Новый Шрифт(,, Истина);
	Область.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;	
	
	Колонка = Колонка + 1;
	
	Область = ТабДокумент.Область(Строка, Колонка);
	Область.Текст = "Остаток";
	Область.Шрифт = Новый Шрифт(,, Истина);
	Область.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;	
	
	Колонка = Колонка + 1;
	
	Для Каждого СсылкаРецепта Из ПорядокРецептур Цикл
		Область = ТабДокумент.Область(Строка, Колонка);
		Область.Текст = Рецептуры[СсылкаРецепта];
		Область.Шрифт = Новый Шрифт(,, Истина);
		//Область.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
        
        Колонка = Колонка + 1;
	КонецЦикла;
	
	// ===== СТРОКИ КОМПОНЕНТОВ =====
	Строка = 2;
	
	Для Каждого ПараКомпонента Из Компоненты Цикл
		Материал = ПараКомпонента.Ключ;
		СтрокаКомпонента = ПараКомпонента.Значение;
		
		Если Материал = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Материал.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		
		Если Материал.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;

		Колонка = 1;		
		ТабДокумент.Область(Строка, Колонка).Текст = Материал.Наименование;
		Колонка = 2;
		ТабДокумент.Область(Строка, Колонка).Текст = ЦеныМатериалов.Получить(Материал);
		Колонка = 3;
		ТабДокумент.Область(Строка, Колонка).Текст = ОстаткиМатериалов.Получить(Материал);
		Колонка = 4;
			
		Для Каждого СсылкаРецепта Из ПорядокРецептур Цикл
			Значение = СтрокаКомпонента.Получить(СсылкаРецепта);
			Если Значение = Неопределено Тогда
				Значение = 0;
			КонецЕсли;
			ТабДокумент.Область(Строка, Колонка).Текст = Значение;
			Колонка = Колонка + 1;
		КонецЦикла;

		Строка = Строка + 1;		
		
	КонецЦикла;
	
	// ===== АВТОШИРИНА =====
	//ТабДокумент.УстановитьРастягиваниеПоГоризонтали(Колонка);
	
КонецПроцедуры

#КонецОбласти
